# install [Task](https://taskfile.dev) task runner.
brew "go-task/tap/go-task"

# install Go and related tools.
brew "go"

brew "gofumpt"
brew "dagger/tap/dagger"
brew "golangci-lint"
brew "golang-migrate"
cask "goreleaser/tap/goreleaser"

# install Python version manager.
brew "uv"

# install cloud utilities.
brew "awscli"
cask "gcloud-cli"
brew "hashicorp/tap/terraform"

# install network utilities.
brew "arping"
brew "nmap"

# other development utilities.
brew "act"
brew "asdf"
brew "jj"
brew "jq"
brew "nats-io/nats-tools/nats"

# other utilities.
brew "cmake"
brew "fzf"
brew "gawk"
brew "p7zip"
brew "pinentry-mac"
brew "pwgen"
brew "wget"
brew "xz"
